openfoam_slicer/base_case/simpleFoam/system/sliceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

SLICEWIDTH 0.1;
MINX -156.0;
MAXX 250.0;
MINY 45.00;
MAXY #calc "$MINY+$SLICEWIDTH";
MINZ 0.7501;
MAXZ 70.0;

GRADE
{
    X
    {
        N 300;
        S ( (0.3 0.3 0.33) (0.7 0.7 3.0) );
    }
    Y
    {
        N 1;
        S 1;
    }
    Z
    {
        N 64;
        S 6;
    }
}

INPOINT
{
    X 0.0;
    Y #calc "$MINY+$SLICEWIDTH/2.0";
    Z 15.0;
}

SUBGRADE
{
    X
    {
        N 127;
        S ( (0.3 0.3 0.33) (0.7 0.7 3.0) );
    }
    Y
    {
        N 1;
        S 1;
    }
    Z
    {
        N 63;
        S 6;
    }
}
